// Задайте значения M и N. Напишите программу,
// которая выведет все натуральные числа в промежутке от M до N.
// M = 1; N = 5 -> "1, 2, 3, 4, 5"
// M = 4; N = 8 -> "4, 5, 6, 7, 8"

int n = 6;
int m = 10;

void RecN (int N, int M)

{
    if (M == N + 1) return;

    else Console.Write($"ЧИСЛО:{M} ");
    RecN(N, M + 1);
}

RecN(m, n);